Reports/КонтрольнаяВедомостьОтраженияЗарплатыВРегУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>КонтрольнаяВедомостьОтраженияЗарплатыВРегУчете</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипДетализацииСтандартныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ТипДетализацииСтандартныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипДетализацииСтандартныхОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Элементы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иерархия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоИерархия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КонтрольнаяВедомостьОтраженияЗарплатыВРегУчете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура("ИспользоватьПередКомпоновкойМакета,
							|ИспользоватьПослеКомпоновкиМакета,
							|ИспользоватьПослеВыводаРезультата,
							|ИспользоватьДанныеРасшифровки",
							Истина, Ложь, Истина, Истина);
							
КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт
	
	ЗаголовокОтчета = НСтр("ru = 'Контрольная ведомость отражения зарплаты в регламентированном учете %1'");
	ЗаголовокОтчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ЗаголовокОтчета, БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода));
	
	Возврат ЗаголовокОтчета;
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт

	Если ПараметрыОтчета.Свойство("ОткрытИзРассылки") И ПараметрыОтчета.ОткрытИзРассылки Тогда
		КомпоновщикНастроек.Настройки.Структура.ИдентификаторПользовательскойНастройки = "";
		КомпоновщикНастроек.Настройки.Выбор.ИдентификаторПользовательскойНастройки     = "";
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	Иначе
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Иначе
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	Налоги = Справочники.НалогиСборыОтчисления;
	СОСчетУчетаРасчетовСКонтрагентомБУ   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ОбязательныеСоциальныеОтчисления            , "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	ОПВСчетУчетаРасчетовСКонтрагентомБУ  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ОбязательныеПенсионныеВзносы                , "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	ИПНСчетУчетаРасчетовСКонтрагентомБУ  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ИндивидуальныйПодоходныйНалог               , "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	СНСчетУчетаРасчетовСКонтрагентомБУ   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.СоциальныйНалог                             , "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	ОППВСчетУчетаРасчетовСКонтрагентомБУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ОбязательныеПрофессиональныеПенсионныеВзносы, "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	ОПВРСчетУчетаРасчетовСКонтрагентомБУ  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ОбязательныеПенсионныеВзносыРаботодателя	  , "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	ВОСМССчетУчетаРасчетовСКонтрагентомБУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование, "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	ООСМССчетУчетаРасчетовСКонтрагентомБУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование, "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	ЕПСчетУчетаРасчетовСКонтрагентомБУ 	  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налоги.ЕдиныйПлатеж								  , "СчетУчетаРасчетовСКонтрагентомБУ").СчетУчетаРасчетовСКонтрагентомБУ;
	
	Типовой = ПланыСчетов.Типовой;
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетСО"  , ?(НЕ ЗначениеЗаполнено(СОСчетУчетаРасчетовСКонтрагентомБУ)  , Типовой.ОбязательстваПоСоциальномуСтрахованию, СОСчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетОПВ" , ?(НЕ ЗначениеЗаполнено(ОПВСчетУчетаРасчетовСКонтрагентомБУ) , Типовой.ОбязательстваПоПенсионнымОтчислениям , ОПВСчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетИПН" , ?(НЕ ЗначениеЗаполнено(ИПНСчетУчетаРасчетовСКонтрагентомБУ) , Типовой.ИндивидуальныйПодоходныйНалог        , ИПНСчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетСН"  , ?(НЕ ЗначениеЗаполнено(СНСчетУчетаРасчетовСКонтрагентомБУ)  , Типовой.СоциальныйНалог                      , СНСчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетОППВ", ?(НЕ ЗначениеЗаполнено(ОППВСчетУчетаРасчетовСКонтрагентомБУ), Типовой.ОбязательстваПоПенсионнымОтчислениям , ОППВСчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетОПВР" , ?(НЕ ЗначениеЗаполнено(ОПВРСчетУчетаРасчетовСКонтрагентомБУ) , Типовой.ОбязательстваПоПенсионнымОтчислениям , ОПВРСчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетВОСМС", ?(НЕ ЗначениеЗаполнено(ВОСМССчетУчетаРасчетовСКонтрагентомБУ), Типовой.ОбязательстваПоВзносамОСМС         , ВОСМССчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетООСМС", ?(НЕ ЗначениеЗаполнено(ООСМССчетУчетаРасчетовСКонтрагентомБУ), Типовой.ОбязательстваПоОтчислениямОСМС     , ООСМССчетУчетаРасчетовСКонтрагентомБУ));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетЕП", ?(НЕ ЗначениеЗаполнено(ЕПСчетУчетаРасчетовСКонтрагентомБУ), 		Типовой.ОбязательстваПоЕдиномуПлатежу	   , ЕПСчетУчетаРасчетовСКонтрагентомБУ));
	Если ЕПСчетУчетаРасчетовСКонтрагентомБУ = Типовой.ОбязательстваПоЕдиномуПлатежу Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "АналитикаЕП", Справочники.НалогиСборыОтчисления.ЕдиныйПлатеж);
	КонецЕсли;
	
	БухгалтерскиеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, ПараметрыОтчета);
	
	// определим какие показатели и в каком порядке показывать
	Для Каждого Показатель Из ПараметрыОтчета.Показатели Цикл
		Если Показатель.Использование Тогда
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек, Показатель.Поле);
		КонецЕсли;
	КонецЦикла;
	
	Структура = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Первый = Истина;
	Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл 
		Если ПолеВыбраннойГруппировки.Использование Тогда
			Если Не Первый Тогда 
				Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			КонецЕсли;
			Первый = Ложь;
						
			ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование  = Истина;
			ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
			
			Если ТипЗнч(ПолеВыбраннойГруппировки.ТипГруппировки) = Тип("ПеречислениеСсылка.ТипДетализацииСтандартныхОтчетов") Тогда
				Если ПолеВыбраннойГруппировки.ТипГруппировки = Перечисления.ТипДетализацииСтандартныхОтчетов.Иерархия Тогда
					ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
				ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = Перечисления.ТипДетализацииСтандартныхОтчетов.ТолькоИерархия Тогда
					ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
				Иначе
					ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
				КонецЕсли;
			КонецЕсли;
			
			Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных")); 
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки) Экспорт
		
	
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);

КонецПроцедуры

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Для Каждого Вариант из Схема.ВариантыНастроек Цикл
		НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, Вариант.Имя);
	КонецЦикла;	
	
КонецПроцедуры

// Возвращает структуру параметров, наличие которых требуется для успешного формирования отчета.
//
// Возвращаемое значение:
//   Структура - структура параметров для формирования отчета.
//
Функция ПустыеПараметрыКомпоновкиОтчета() Экспорт
	
	ПараметрыОтчета = РассылкаОтчетовБК.НастройкиОтчетаСохраняемыеВРассылке();
	
	Возврат ПараметрыОтчета;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


#КонецЕсли
